
#include <iostream>

#include <math.h>

using namespace std;

/*
Коло вписане в квадрат із заданою площею.
1.Хайти площу квадрата, вписаного в це коло.
2.Визначити у скільки разів площа вписаного менше за площу заданого квадрату.
*/

int main()
{

	setlocale(LC_ALL, "russian");


	double Sb;									//Площа описаного квадрату//
	cout << "Введiть площу квадрата описаного навколо кола" << endl;
	cin >> Sb;



	double a;      //Сторона описаного квадрату//
	a = sqrt(Sb);


	/*
	Пів сторони описаного квадрату дарівнює радіусу кола, а два радіуси кола
	дорівнюють діагоналі вписаного квадрату. Площу вписаного квадрату розрахуємо за формулою 0.5*d^2
	*/


	double Ss;     //Площа вписаного квадрату//
	Ss = 0.5 * pow(a, 2);



	double k;					//Відношення площини описаного квадрата до площини вписаного//
	k = Sb / Ss;



	if (Sb < 0 or Sb == 0) cout << "Площа квадрата не може бути менша або дорiвнювати 0";
	else cout << "Площа квадрата вписаного у коло" << " " << Ss << endl																	//Відповідь//
		<< "Площа квадрату вписаного у коло у" << " " << k << " " << "менше нiж площа квадрата описаного навколо кола." << endl;



	system("pause");

}